{
    "1.10.0": [
        "Carga de configuraci贸n din谩mica mejorada en iOS para evitar problemas de sincronizaci贸n.",
        "Se agregaron descripciones de permisos de red localizados en iOS."
    ],
    "1.9.0": [
        "Redise帽o de la pantalla \"M谩s\" para una mejor organizaci贸n y usabilidad.",
        "Visualizaci贸n de la versi贸n actual de la aplicaci贸n en la pantalla \"M谩s\".",
        "La detecci贸n de la versi贸n actual de la aplicaci贸n ahora es din谩mica en las notas de lanzamiento."
    ],
    "1.8.1": [
        "Se corrigi贸 un error que pod铆a causar la p茅rdida del progreso de lectura tras una actualizaci贸n."
    ],
    "1.8.0": [
        "Nueva pantalla de notas de la versi贸n.",
        "Refactorizaci贸n de la l贸gica de representaci贸n de fechas para que sea m谩s din谩mica.",
        "Mejoras en la interfaz de usuario para la visualizaci贸n de versiones futuras.",
        "Correcci贸n de traducciones en espa帽ol y portugu茅s.",
        "Cambio de colores de iconos en la pantalla \"M谩s\" para algunos elementos.",
        "Mejora en la interfaz de selecci贸n de temas: nuevo dise帽o del layout, adici贸n de la selecci贸n de contraste y reubicaci贸n de la opci贸n de colores din谩micos.",
        "Se agregaron nuevas opciones de donaci贸n."
    ],
    "1.7.0": [
        "Se introdujo la carga para indicar que algunas configuraciones remotas se est谩n obteniendo del servidor.",
        "Nueva pantalla de muro de pago.",
        "Enlaces a la aplicaci贸n web.",
        "Nueva pantalla de libros que permite seguir el progreso, realizar b煤squedas, aplicar filtros, ordenar y marcar como favoritos."
    ],
    "1.6.2": [
        "Esperar algunas configuraciones remotas antes de poder proceder con otras operaciones."
    ],
    "1.6.1": [
        "Correcciones de espaciado en muchas pantallas, principalmente para Android 15+ en barras del sistema."
    ],
    "1.6.0": [
        "Nueva pantalla \"M谩s\", enfocada en configuraciones generales y enlaces 煤tiles.",
        "Correcci贸n del desplazamiento en algunas pantallas en formato horizontal.",
        "Uso de tarjetas en la interfaz de usuario para listas de pasajes en la pantalla de detalles del d铆a."
    ],
    "1.5.0": [
        "Introducci贸n de confirmaci贸n para eliminar notas."
    ],
    "1.4.0": [
        "Implementaci贸n de notas personales para los d铆as del plan de lectura.",
        "Correcci贸n de formato en la secci贸n de notas.",
        "Ajuste en la secci贸n de notas."
    ],
    "1.3.0": [
        "Adici贸n de fechas de lectura planificadas a los d铆as del plan de lectura.",
        "Correcci贸n: c谩lculo correcto de la fecha de lectura planificada.",
        "Cambio en el orden del texto en la barra superior de la pantalla de detalles del d铆a."
    ],
    "1.2.2": [
        "Correcci贸n: falta de informaci贸n en los detalles del d铆a cuando debemos leer vers铆culos espec铆ficos."
    ],
    "1.2.1": [
        "Correcci贸n en el formato de fecha para admitir nombres de meses localizados."
    ],
    "1.2.0": [
        "Adici贸n de animaci贸n de transici贸n al navegar de la pantalla de planes a la pantalla de detalles del d铆a. La animaci贸n se agreg贸 en las palabras del d铆a y la semana.",
        "Animaci贸n de contadores de progreso para el d铆a y progreso en la pantalla de planes y pantalla de detalles del d铆a.",
        "Adici贸n de animaci贸n de visibilidade al bot贸n \"ir a no le铆dos\".",
        "Adici贸n de localizaci贸n en ingl茅s y espa帽ol para el nombre de la aplicaci贸n en iOS."
    ],
    "1.1.0": [
        "Reemplazo del 铆cono para cambiar tema en la pantalla de planes de lectura.",
        "Mostrar mensaje de snackbar cuando no hay progreso de lectura para eliminar."
    ],
    "1.0.0": [
        "La primera vers茫o de Bible Planner ."
    ]
}